# How to deal with missing data

In [1]:
import numpy as np
import pandas as pd

In [10]:
d = { 'A':[1,2,np.nan] , 'B':[5, np.nan, np.nan], 'C':[1,2,3] }

In [11]:
d

{'A': [1, 2, nan], 'B': [5, nan, nan], 'C': [1, 2, 3]}

In [12]:
df = pd.DataFrame(d)

In [13]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [14]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [15]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [16]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [20]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2